IDEA StatiCa Open Model
Element2D.EccentricityZ Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Displacement in local axis Z
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double EccentricityZ { get; set; }
Public Property EccentricityZ As Double
	Get
	Set
public:
property double EccentricityZ {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
Element2D Class
IdeaRS.OpenModel.Model Namespace